Page({
    data: {
        photoList: [
          {
            "location": "汉口路校门",
            "images": [
              "https://box.nju.edu.cn/f/94c3c8dcbc1c439a9d16/?dl=1",
              "https://box.nju.edu.cn/f/287fee69936047e78e61/?dl=1"
            ],
            "description": "汉口路校门建于1959年国庆，是鼓楼校区南北园交界线，已经陪伴南大人六十余载。校门两侧的立柱上绘有“团结紧张”、“严肃活泼”毛体手书浮雕，豪放酣畅，大气磅礴，历经光阴陶染而越发闪亮。2018年，汉口路校门被列入南京市第二批历史建筑保护名录。而今，你们也将踏进汉口路校门，不停修炼南大人“诚朴雄伟，励学敦行”的品格。从陌生到熟悉，汉口路校门期待与你共赴四年之约。"
          },
          {
            "location": "二源壁",
            "images": [
              "https://box.nju.edu.cn/f/0196993dd9d7469999b9/?dl=1",
              "https://box.nju.edu.cn/f/75b5d23b422742b28051/?dl=1",
              "https://box.nju.edu.cn/f/06a427262686499bbcee/?dl=1"
            ],
            "description": "在南京大学校园老图书馆前，有一个“二源壁”。壁的前后两面镶嵌着两块20世纪初镌刻的学堂碑石。其中一块上书“两江师范学堂”六个遒劲、雄浑的魏碑体大字；另一块则以柳体大书“金陵大学堂”。流逝的岁月已经在这两块碑石上留下斑斑苍苔、缕缕裂痕，平添几分古朴之气，令人倍增沧桑之感。两江师范学堂的前身是1902年筹建的三江师范学堂，南京大学即肇始于此。我们今天要说的北大楼，则坐落在南京大学鼓楼校区，这里原是金陵大学校址。金陵大学堂成立于1910年，它的源头可以追溯到1888年由美国基督教会创办的汇文书院。1952年全国院系调整时，南京大学的工、农、师范等学院及相关系科独立，同时并入金陵大学的文、理学院，仍名南京大学。因此，金陵大学是南京大学的另一个重要源头。"
          },
          {
            "location": "小礼堂",
            "images": [
              "https://box.nju.edu.cn/f/906bd6a2a0f2408bbd4b/?dl=1",
              "https://box.nju.edu.cn/f/744e29c49ad74f0997a9/?dl=1",
              "https://box.nju.edu.cn/f/6e48da2e705f42698983/?dl=1",
              "https://box.nju.edu.cn/f/cc641d4b16be46f8a503/?dl=1",
              "https://box.nju.edu.cn/f/503d2c9699354e20b7b2/?dl=1"
            ],
            "description": "建于1916年，由中国建筑师齐兆昌、美国芝加哥珀金斯建筑师事务所共同设计的小礼堂，是当年金陵大学内最为精美的建筑，也是现在无数南大学子的精神寄托。<br/>建设之初，小礼堂的东侧有钟亭一座，内悬挂有铜钟，每日上下课的钟声由此敲出，也成为余光中先生创作《钟声说》的灵感来源。铜钟曾遗失，后在南京大学百年校庆之时重建。<br/>造型酷似《西游记》里孙悟空为躲避杨二郎的追踪化身所成的小庙，只是屋后少了旗杆<br/>屋顶为歇山顶，单层建筑，拱形门，大门上方用砖砌出三面围裹的结构，既可支撑墙体，又有装饰作用。门楣和窗框饰有石刻西式图案。门前有抱鼓石一对，踏道间设丹陛石，上面雕刻纹饰。小礼堂精巧灵秀，有中国南方建筑的味道。<br/>原堂前同时建一钟亭。钟亭毁于兵燹，铜钟遗失。南大百年校庆期间重建钟亭。"
          },
          {
            "location": "大礼堂",
            "images": [
              "https://box.nju.edu.cn/f/d80939737cf94930b70b/?dl=1",
              "https://box.nju.edu.cn/f/c4c4ebc89ee349a9b682/?dl=1",
              "https://box.nju.edu.cn/f/151de34a84784bd1bf57/?dl=1",
              "https://box.nju.edu.cn/f/e14819f67a8a4fd499b1/?dl=1"
            ],
            "description": " 全国重点文物保护单位。礼拜堂（今大礼堂）位于西大楼南面，始建于1918年，由戴先生（Mr.Day）捐资所建，因此又称Day Chapel。此楼由美国芝加哥帕金斯建筑事务所于1917年完成设计，陈明记营造厂承建。<br/>礼拜堂的设计部分汲取我国古代庙宇造型，严谨庄重。平面为西式巴西利卡式教堂平面，单层大空间，砖木结构。主体屋顶为歇山顶，其余部分有六个小硬山顶，歇山山面朝东，与主入口一致。原设计方案及建成后的礼拜堂，在正脊两端正面，用教会建筑特有的十字架（现已不存在），代替我国传统建筑鸱吻。外墙均为明城砖砌筑，并创造性地用砖石建材代替（象征）我国古代建筑中木制的建筑构件、雕刻等，清水砖墙身，底部数道线脚。歇山顶垂鱼部位、硬山顶山花。大礼堂经多次改造，原初形状与现状略有不符<br/>。现为南京大学鼓楼校区大礼堂，一直以来均为师生聚会及举行大型纪念性活动的重要场所。"
          },
          {
            "location": "北大楼",
            "images": [
              "https://box.nju.edu.cn/f/5e70a445502447ba8654/?dl=1",
              "https://box.nju.edu.cn/f/c604f889529e4e11bd22/?dl=1",
              "https://box.nju.edu.cn/f/714b86adc8264fe18a79/?dl=1",
              "https://box.nju.edu.cn/f/1f72fd3d1d6e4bdbbb34/?dl=1"
            ],
            "description": "南京大学北大楼即原金陵大学钟楼，位于南京大学鼓楼校区，现为南京大学鼓楼校区行政楼。建于1917年，由美国建筑师司迈尔设计，建筑风格体现了近代以西方建筑风格对中国的影响，又保持了中国传统的建筑特色。   <br/> 大楼中部建有一座5层高的正方形塔楼，将整座建筑分成对称的东西两半；塔楼顶部是十字形脊顶，实际上为西洋式钟楼的变体；楼体则由明代城墙砖砌筑而成。  <br/>  大楼采用中国传统的建筑形式设计，同时又糅合了西方的建筑风格：中部建有一座5层高的正方形塔楼，将整座建筑分成对称的东西两半；塔楼顶部是十字形脊顶，实际上为西洋式钟楼的变体；楼体由明代城墙砖砌筑而成。    <br/>   这些有着600多年历史的墙砖以及盘绕其上的爬山虎，让整幢建筑显得格外宁静、古朴和厚重，一如它所在的大学和城市。历经百年风雨的北大楼如今是南大人心中的圣地。在翠树掩映的校园中，高高矗立的塔楼犹如一位不朽的守望者，无声地言说“诚、朴、雄、伟、励、学、敦、行”的校训。这正是召唤余光中先生跨越那弯浅浅的海峡、回归母校的钟声，也是激荡着每一个南大人心魂的钟声。 <br/>   关于南京大学北大楼的纪念诗歌，比较有名的是著名“诗人外交家”厉声教先生1956年即将毕业离开母校南京大学时创作的《满江红·浩浩长江》和2002年南京大学百年校庆之日，著名诗人余光中先生回到母校朗诵的《钟声说》。诗中提到的建筑，就是南京大学的“地标”——北大楼。"
          },
          {
            "location": "革命烈士纪念碑",
            "images": [
              "https://box.nju.edu.cn/f/c3bec165d0374213839a/?dl=1",
              "https://box.nju.edu.cn/f/d6b5fe1719e2466abb51/?dl=1",
              "https://box.nju.edu.cn/f/f32c47ad59b44115944b/?dl=1"
            ],
            "description": "南京大学（原中央大学）具有光荣的革命传统，五四时期就是南京地区爱国学生运动的中坚。在革命的各个历史时期，中央大学的进步师生始终站在爱国民主运动的前列，为坚持团结抗战和争取民主而奔走呼吁，先后发起了“禁毒运动” 、声势浩大的“反饥饿、反内战、反迫害”的“五二·爱国学生运动”等。郁郁青山埋忠骨，烈烈英魂诉长风。1982年正值南京大学成立八十周年之际，为了永远缅怀革命先烈，南京大学的全体师生筹资建造了南京大学革命烈士纪念碑，纪念碑底座为正方形，碑身正面写有“革命烈士永垂不朽”八个大字，碑身后面刻有从南京大学毕业后参加革命而牺牲的谢远定等21位烈士的简历。<br/> 五二〇学生爱国运动<br/> 抗战胜利后，全国人民渴望实现祖国独立、和平、民主，而国民党政府强化独裁统治，发动内战，变中国为美国殖民地，广大人民处于水深火热之中。<br/>1946年6月底，国民党挑起全面内战，11月又与美国签订了出卖国家主权的“中美通商条约”，片面召开伪国民大会，制定伪宪法。12月底又发生了美军强奸北大女大学生事件。几十个大中城市数十万学生举行罢课和游行，抗议美军罪行，要求美军撤出中国。<br/>国民党反动当局的高压政策更加激起学生们的义愤，在党组织的领导下，许多学校酝酿举行规模更大的游行示威活动。5月19日，就在《维持社会秩序临时办法》颁布的第二天，上海大中专14所学校7000多名学生以欢送沪杭区国立院校抢救教育危机晋京代表联合请愿团名义，举行了反饥饿、反内战大游行。游行队伍高举“向炮口要饭吃”等横标。5月20日，华北、宁沪等地学生分别在北平、天津、南京和上海等地举行了“反饥饿、反内战、反迫害”大游行。学生们一路高呼：“反内战、反饥饿、反独裁”，“反对征兵征粮”，“增加教育经费”，“取消特务组织”等口号，并积极准备于6月2日发动罢课、罢教、罢工、罢市。各地游行队伍遭到国民党特务和军警的血腥镇压。当天是国民参政会四届三次大会开幕之日，国民党当局在首都南京布下重兵，严阵以待，前往南京举行联合示威游行的宁沪苏杭16个专科以上学校6000多名学生，遭到国民党军警皮鞭、棍棒袭击，学生重伤19人，轻伤104人，被捕28人；天津学生有17人被捕，近50人受伤；这就是震惊全国的“五二零”惨案。<br/>烈士如火，灼灼炽热；烈士如星，光照永垂。<br/>斯人已逝，风骨犹存。我们不应忘记，也不会忘记，那些刻在纪念碑上熠熠生辉的名字。他们将青春与热血谱写进中华民族前行的道路中，他们的事迹与精神永垂不朽！"
          },

          {
            "location": "大纛坪",
            "description": "1934年秋，与金陵大学仅有一墙之隔的日本领事馆兀然竖起一座钢骨旗杆，每日升挂“太阳旗”。全校学生忿而共慨，朱恕、郑槐等30余人联名要求建筑金陵大学的旗杆，以显精神，以壮观瞻。1935年8月，一座高耸入云的旗杆拔地而起——此旗杆入土5米，地上部分由28节钢管套接而成，高40米，比日本领事馆的旗杆高出10尺有余，质量与外观都胜日本旗杆一筹，以镇其邪、挫其锐、克其霸！<br/>在纪念抗日战争胜利50周年的时候，南京大学特将此处正式辟成“大纛坪”(原来旗杆位置在大礼堂与教学楼之间大香樟树旁，1962年为造教学楼而移至现在位置)。每逢节日庆典，广大师生便列队坪上，隆重举行庄严的升旗仪式。今日的大纛坪和大旗杆，不甘人下的历史印记展示着南大人的不屈挺拔。",
            "images": [
              "https://box.nju.edu.cn/f/589af40849354102b9a8/?dl=1",
              "https://box.nju.edu.cn/f/680d3edf744648c0a8b7/?dl=1",
              "https://box.nju.edu.cn/f/1e4f8642c64c4c4d9a00/?dl=1"
            ]
          },
          {
            "location": "赛珍珠纪念馆",
            "description": "位于北园西墙跟下的赛珍珠楼是江苏省级重点文物保护单位，建于1912年，原为教员 Mr.Moss 宿舍。2012年5月19日，这座有着100多年历史的小楼完成修复并以“赛珍珠纪念馆”的新身份正式对外开放。赛珍珠为促进中国和西方世界的相互理解作出了杰出贡献，被誉为“一座沟通东西方文明的人桥”。很多西方人正是从赛珍珠的作品中，形成对中国的最初印象，并萌生了对中国的好感和向往。1921年至1931年间，她任金陵大学外语系教授时和卜凯生活在这栋小楼里，离开中国前一直在此居住、写作。",
            "images": [
              "https://box.nju.edu.cn/f/06d9476f53544457b536/?dl=1",
              "https://box.nju.edu.cn/f/c61062fec3114cf5bab9/?dl=1",
              "https://box.nju.edu.cn/f/1f2ec0f2da1c49fdae83/?dl=1",
              "https://box.nju.edu.cn/f/16753bb6fa904b46a9ea/?dl=1"
            ]
          },
          {
            "location": "斗鸡闸",
            "description": "从汉口路进入北园，沿着中大路前行，向西侧看会发现掩藏在绿荫里的斗鸡闸。斗鸡闸始建于1934年，由著名建筑师沈鹤甫设计。1937年12月毁于战火。1945年秋，何应钦回南京后在原址重建，翌年3月竣工。重建后的斗鸡闸结构未变，基本上保持着原有的风貌，但装饰一新，房屋外部为鲜亮的米黄色，顶部则覆盖着中国传统的瓦蓝色琉璃，四周广植雪松花木，现为南京大学外事办公室所在地，专作接待贵宾之用，属于江苏省级重点文物保护单位。掩映在苍松翠柏中的斗鸡闸低调而神秘，却常常吸引着行人的目光，遮不住那不同寻常的气势，仿佛欲一吐往日那段曲折的历史。",
            "images": [
              "https://box.nju.edu.cn/f/d40a391dc86745488461/?dl=1",
              "https://box.nju.edu.cn/f/b6a418bebeff44ea81db/?dl=1",
              "https://box.nju.edu.cn/f/c8566f14a2da4b28b88c/?dl=1"
            ]
          },
          {
            "location": "图书馆",
            "description": "南京大学鼓楼校区图书馆馆藏丰富，经长期积累，形成了比较系统、完整的综合性的藏书体系。至2007年底，总藏书量达到491.70万册（含院系资料室）。馆藏古籍线装书近40万册，其中善本古籍有3000余种、3万余册。地方文献、古代目录学文献以及丛书的收藏已形成特色。古代地方志共收藏有4000余种，近4万册，在各大图书馆中处于领先地位。收藏了多个国家和地区的多个语种的期刊，尤以物理、生物、地学、数学为特色。",
            "images": [
              "https://box.nju.edu.cn/f/f7affa9a260a49f3a04a/?dl=1",
              "https://box.nju.edu.cn/f/5401eb69e7214edc862d/?dl=1",
              "https://box.nju.edu.cn/f/aba6b33dd2c045c7b1a8/?dl=1"
            ]
          },
          {
            "location": "南大食堂",
            "description": "鼓楼校区一共有四个食堂，都在同一栋楼中，位于八舍后方、陶园二舍对面，分别是一二三食堂和最顶层的清真餐厅。其中，一食堂的营业时间最长，菜品种类也最为丰富。一食堂的麻辣鸡丝、手工水饺、二食堂的韩式辛拉面、三食堂的香锅、四食堂的铁板面……更多美食等你发现！",
            "images": [
              "https://box.nju.edu.cn/f/bc1f81fc29ad479dbd15/?dl=1",
              "https://box.nju.edu.cn/f/6ddf02f8e13b4f55832c/?dl=1",
              "https://box.nju.edu.cn/f/79eb4e9927a34f128936/?dl=1"
            ]
          },
          {
            "location": "郑钢楼",
            "description": "南京大学鼓楼校区教学楼建于1964年，位于北园中心位置，总建筑面积6600平方米。教学楼使用至今，已逾50年，积淀了一代又一代南大人的青春记忆。2015年，郑钢校友向母校捐资1000万元人民币，其中500万元用于教学楼的修缮、维护、提档升级。为了感谢郑钢校友慷慨回馈母校之举，经学校研究决定将教学楼冠名为“郑钢楼”，并镌刻碑记，昭彰弘扬。",
            "images": [
              "https://box.nju.edu.cn/f/bcc25bb348eb422992ac/?dl=1",
              "https://box.nju.edu.cn/f/443911e9d6d341ecb9bf/?dl=1",
              "https://box.nju.edu.cn/f/c554a12d306949c49c44/?dl=1",
              "https://box.nju.edu.cn/f/bf546bed1bee4e43a2a2/?dl=1"
            ]
          },
          {
            "location": "南园生活区",
            "description": "踏入鼓楼校区的生活区：南园。率先映入眼帘的便是绿丛环绕的南园喷泉，在午后傍晚，还有机会在这里听到悠扬的乐曲。另外，小蓝鲸们从校门走到喷泉的路上可别忘了关注左右两侧的南园橱窗哦~ 讲座安排、社团信息等通知都会张贴在这里，是同学们发布与获取信息的重要平台。",
            "images": [
              "https://box.nju.edu.cn/f/eed1f0709b0d4d34987a/?dl=1",
              "https://box.nju.edu.cn/f/cd52ff873fa24679857c/?dl=1",
              "https://box.nju.edu.cn/f/5cef923320044411b6a9/?dl=1"
            ]
          },
          {
            "location": "运动场馆",
            "description": "鼓楼校区的运动场馆主要包括北园的苏浙运动场、吕志和游泳馆、体育馆。苏浙运动场位于北园东北部，拥有标准化综合田径运动场、人造草坪足球场，以及多个篮球场、单双杠区、跳高区、跳远区和铅球投掷区，场地开阔、功能齐全，是鼓楼小蓝鲸日常锻炼的上佳选择。",
            "images": [
              "https://box.nju.edu.cn/f/7acdb710a3034df1b2b6/?dl=1",
              "https://box.nju.edu.cn/f/6e4318d12d5d42fbb099/?dl=1",
              "https://box.nju.edu.cn/f/bcd9e5dd9fdc42bd931f/?dl=1",
              "https://box.nju.edu.cn/f/e872d00451794d96b5b0/?dl=1"
            ]
          },
          {
            "location": "校史馆",
            "description": "南京大学校史博物馆及数字化校史博物馆，自1999年5月开始筹建，在校领导及全校广大师生、海内外校友的支持下，于南京大学百年校庆之际开馆。校史博物馆建在南京大学老图书馆（原金陵大学图书馆）内，使用面积1400平方米，展区面积约1000平方米。展区分为‘百年校史’、‘今日南大’、‘百年英才’、‘多媒体演示’及‘礼品厅’等五个展区。",
            "images": [
              "https://box.nju.edu.cn/f/c4902dfce6c842bf89c0/?dl=1",
              "https://box.nju.edu.cn/f/968f793e4c284f8a935a/?dl=1",
              "https://box.nju.edu.cn/f/fd717e79554d41ea949f/?dl=1",
              "https://box.nju.edu.cn/f/16e6922fb25d4921bc6d/?dl=1",
              "https://box.nju.edu.cn/f/aa4a92dd70c54f61af75/?dl=1"
            ]
          }
        ]
        
    },

    // 其他函数...

    saveButtonClick: function (e) {
        const imageUrl = e.currentTarget.dataset.imageUrl;
        if (imageUrl) {
            this.saveImageToAlbum(imageUrl);
        } else {
            console.error('未找到有效的图片URL');
            wx.showToast({
                title: '未找到有效的图片URL',
                icon: 'none'
            });
        }
    },
    onShow() {
      if (typeof this.getTabBar === 'function' && this.getTabBar()) {
        const page = getCurrentPages().pop();
        this.getTabBar().setData({
          value: '/' + page.route
        })
        }
      },
    saveImageToAlbum: function (imageUrl) {
        wx.downloadFile({
            url: imageUrl,
            success: (res) => {
                if (res.statusCode === 200) {
                    const filePath = res.tempFilePath;
                    wx.saveImageToPhotosAlbum({
                        filePath: filePath,
                        success: (saveRes) => {
                            wx.showToast({
                                title: '图片保存成功',
                                icon: 'success'
                            });
                        },
                        fail: (saveErr) => {
                            console.error('保存图片失败:', saveErr);
                            wx.showToast({
                                title: '图片保存失败',
                                icon: 'none'
                            });
                        }
                    });
                } else {
                    console.error('下载图片失败:', res.statusCode);
                    wx.showToast({
                        title: '下载图片失败',
                        icon: 'none'
                    });
                }
            },
            fail: (error) => {
                console.error('下载图片失败:', error);
                wx.showToast({
                    title: '下载图片失败',
                    icon: 'none'
                });
            }
        });
    }
});
